wagiminator/Development-Boards/STM32F030F4P6_DevBoard/software/stm32f030/watchdog/include/stm32f03x.h
// ===================================================================================
// Header file for STM32F030 and STM32F031                                    * v1.0 *
// ===================================================================================
// This contains a copy of core_cm0.h and stm32f031x6.h.
// NOTE: This file includes modifications by Stefan Wagner.

#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

// Configuration of the Cortex-M0+ Processor and Core Peripherals
#define __CORTEX_M                0 /*!< Cortex-M Core                                 */
#define __CM0_REV                 0 /*!< Core Revision r0p0                            */
#define __MPU_PRESENT             0 /*!< STM32F0xx  provides no MPU                    */
#define __NVIC_PRIO_BITS          2 /*!< STM32G0xx uses 2 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0 /*!< Set to 1 if different SysTick Config is used  */
#define __FPU_USED                0 /*!< This core does not support an FPU at all      */

// Clock values
#define HSE_VALUE      8000000U     /*!< Value of the External oscillator in Hz */
#define HSI_VALUE      8000000U     /*!< Value of the Internal oscillator in Hz */
#define LSI_VALUE        40000U     /*!< Value of LSI in Hz */
#define LSE_VALUE        32768U     /*!< Value of LSE in Hz */

// Interrupt Number Definition
typedef enum
{
/******  Cortex-M0 Processor Exceptions Numbers *****************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                               */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M0 Hard Fault Interrupt                       */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M0 SV Call Interrupt                         */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M0 Pend SV Interrupt                         */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M0 System Tick Interrupt                     */

/******  STM32F0 specific Interrupt Numbers *********************************************************/
  WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                              */
  PVD_IRQn                    = 1,      /*!< PVD Interrupt through EXTI Lines 16                    */
  RTC_IRQn                    = 2,      /*!< RTC Interrupt through EXTI Lines 17, 19 and 20         */
  FLASH_IRQn                  = 3,      /*!< FLASH global Interrupt                                 */
  RCC_IRQn                    = 4,      /*!< RCC global Interrupt                                   */
  EXTI0_1_IRQn                = 5,      /*!< EXTI Line 0 and 1 Interrupt                            */
  EXTI2_3_IRQn                = 6,      /*!< EXTI Line 2 and 3 Interrupt                            */
  EXTI4_15_IRQn               = 7,      /*!< EXTI Line 4 to 15 Interrupt                            */
  DMA1_Channel1_IRQn          = 9,      /*!< DMA1 Channel 1 Interrupt                               */
  DMA1_Channel2_3_IRQn        = 10,     /*!< DMA1 Channel 2 and Channel 3 Interrupt                 */
  DMA1_Channel4_5_IRQn        = 11,     /*!< DMA1 Channel 4 and Channel 5 Interrupt                 */
  ADC1_IRQn                   = 12,     /*!< ADC1 Interrupt                                         */
  TIM1_BRK_UP_TRG_COM_IRQn    = 13,     /*!< TIM1 Break, Update, Trigger and Commutation Interrupt  */
  TIM1_CC_IRQn                = 14,     /*!< TIM1 Capture Compare Interrupt                         */
  TIM2_IRQn                   = 15,     /*!< TIM2 global Interrupt                                  */
  TIM3_IRQn                   = 16,     /*!< TIM3 global Interrupt                                  */
  TIM6_IRQn                   = 17,     /*!< TIM6 global Interrupt                                  */
  TIM7_IRQn                   = 18,     /*!< TIM7 global Interrupt                                  */
  TIM14_IRQn                  = 19,     /*!< TIM14 global Interrupt                                 */
  TIM15_IRQn                  = 20,     /*!< TIM15 global Interrupt                                 */
  TIM16_IRQn                  = 21,     /*!< TIM16 global Interrupt                                 */
  TIM17_IRQn                  = 22,     /*!< TIM17 global Interrupt                                 */
  I2C1_IRQn                   = 23,     /*!< I2C1 Event & EXTI Line23 Interrupt (I2C1 wakeup)       */
  I2C2_IRQn                   = 24,     /*!< I2C2 Event Interrupt                                   */
  SPI1_IRQn                   = 25,     /*!< SPI1 global Interrupt                                  */
  SPI2_IRQn                   = 26,     /*!< SPI2 global Interrupt                                  */
  USART1_IRQn                 = 27,     /*!< USART1 global & EXTI Line25 Interrupt (USART1 wakeup)  */
  USART2_IRQn                 = 28,     /*!< USART2 global & EXTI Line26 Interrupt (USART2 wakeup)  */
  USART3_6_IRQn               = 29,     /*!< USART3 to USART6 global Interrupt                      */
} IRQn_Type;

// Exported_types
typedef enum {
  RESET = 0,
  SET = !RESET
} FlagStatus, ITStatus;

typedef enum {
  DISABLE = 0,
  ENABLE = !DISABLE
} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {
  SUCCESS = 0,
  ERROR = !SUCCESS
} ErrorStatus;

// Exported_macros
#define SET_BIT(REG, BIT)     ((REG) |= (BIT))
#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))
#define READ_BIT(REG, BIT)    ((REG) & (BIT))
#define CLEAR_REG(REG)        ((REG) = (0x0))
#define WRITE_REG(REG, VAL)   ((REG) = (VAL))
#define READ_REG(REG)         ((REG))
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))


/**************************************************************************//**
 * @file     core_cm0.h
 * @brief    CMSIS Cortex-M0 Core Peripheral Access Layer Header File
 * @version  V5.0.5
 * @date     28. May 2018
 ******************************************************************************/
/*
 * Copyright (c) 2009-2018 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

